# -*- coding: cp1251 -*-

# Задание 9: XYZ.
# УСЛОВИЕ:
# Написать функционал без использования
# каких-либо условных выражений, а применив
# встроенные функции min() и max(), который
# принимает три аргумента - числа X, Y, Z и
# возвращает один из вариантов в порядке возрастания значимости:
# - X, если Y < X;
# - Z, если Y > Z;
# - Y, при ином раскладе.
# =========================================================================


print "==== Task 9: XYZ  ===="
print 'INPUT: X = 4 Y = 3 Z = 1'

x = 4 
y = 3
z = 1

if y > z:
    print "Result:", z
elif y < x:
    print "Result:", x
else:
    print "Result:", y
    

# Вы же сами говорили - "Код для человека, а не для машины" :-)
# Другого, хитромудрого решения, я найти не успел, но очень хотел бы его узнать.
# Если Вас не знатруднит, пришлите его по почте.    
    
    
    

raw_input()


        
            
            













